#Pandas

##DataFrame

###요소 인덱싱

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
pd.set_option('display.unicode.east_asian_width', True)

In [13]:
exam_data = {'이름':['경석', '연주', '선희'],
            '수학':[90, 85, 70],
            '영어':[98, 88, 95],
            '음악':[85, 79, 78],
            '체육':[80, 79, 75]}
df = pd.DataFrame(exam_data)
df.set_index('이름', inplace=True)
print(df)

      수학  영어  음악  체육
이름
경석    90    98    85    80
연주    85    88    79    79
선희    70    95    78    75

In [10]:
df.loc['경석']['체육'] = 100
df.loc['연주', ['수학', '영어']] = 70, 80
new_index = ['경석', '연주', '선희', '덕유']
df = df.reindex(new_index)
df.loc['덕유', ['수학', '영어', '음악', '체육']] = 70, 80, 80, 40
df['국어'] = 90, 100, 85, 95

In [4]:
print(df.shape)

(3, 4)

In [5]:
print(df.iloc[0][3])
df.iloc[0][3] = 90
print(df)

80
      수학  영어  음악  체육
이름
경석    90    98    85    90
연주    85    88    79    79
선희    70    95    78    75

In [15]:
df.loc['경석']['체육'] = 100
print(df)

      수학  영어  음악  체육
이름
경석    90    98    85   100
연주    85    88    79    79
선희    70    95    78    75

In [16]:
df.loc['경석', '체육'] = 110
print(df)

      수학  영어  음악  체육
이름
경석    90    98    85   110
연주    85    88    79    79
선희    70    95    78    75

In [18]:
df.loc['경석', ['체육', '음악']] = 120, 130
print(df)

      수학  영어  음악  체육
이름
경석    90    98   130   120
연주    85    88    79    79
선희    70    95    78    75

In [20]:
df_added = df.reindex(['경석', '연주', '선희', '옥호', '민자'], fill_value = 0)
df_added_sorted = df_added.sort_index()

df_added_sorted

      수학  영어  음악  체육
이름
경석    90    98    85    80
민자     0     0     0     0
선희    70    95    78    75
연주    85    88    79    79
옥호     0     0     0     0

###함수

In [23]:
print(df)
print('-----------------------------------')
df = df.transpose()
print(df)

      수학  영어  음악  체육
이름
경석    90    98   130   120
연주    85    88    79    79
선희    70    95    78    75
-----------------------------------
이름  경석  연주  선희
수학    90    85    70
영어    98    88    95
음악   130    79    78
체육   120    79    75

In [24]:
df = df.T
print(df)

      수학  영어  음악  체육
이름
경석    90    98   130   120
연주    85    88    79    79
선희    70    95    78    75

In [25]:
ndf1 = df.set_index('음악')
print(ndf1)

      수학  영어  체육
음악
130     90    98   120
79      85    88    79
78      70    95    75

In [26]:
ndf2 = df.set_index(['수학', '음악'])
print(ndf2)

           영어  체육
수학 음악
90   130     98   120
85   79      88    79
70   78      95    75

In [27]:
ndf3 = ndf2.reset_index()
print(ndf3)

   수학  음악  영어  체육
0    90   130    98   120
1    85    79    88    79
2    70    78    95    75

In [28]:
ndf4 = ndf3.reset_index()
print(ndf4)

   index  수학  음악  영어  체육
0      0    90   130    98   120
1      1    85    79    88    79
2      2    70    78    95    75

In [33]:
print(df)
print(df.index)
df.index = ['옥호', '민자', '영숙']
#df.index = ['옥호', '민자', '영숙', '영림']
print(df)

      수학  영어  음악  체육
옥호    90    98   130   120
민자    85    88    79    79
영숙    70    95    78    75
Index(['옥호', '민자', '영숙'], dtype='object')
      수학  영어  음악  체육
옥호    90    98   130   120
민자    85    88    79    79
영숙    70    95    78    75

In [34]:
new_index = ['옥호', '민자', '영숙', '덕유', '영림']
ndf = df.reindex(new_index)
print(ndf)

      수학  영어   음악   체육
옥호  90.0  98.0  130.0  120.0
민자  85.0  88.0   79.0   79.0
영숙  70.0  95.0   78.0   75.0
덕유   NaN   NaN    NaN    NaN
영림   NaN   NaN    NaN    NaN

In [40]:
ndf = df.reindex(new_index, fill_value=0)
print(ndf)

      수학  영어  음악  체육
옥호    90    98   130   120
민자    85    88    79    79
영숙    70    95    78    75
덕유     0     0     0     0
영림     0     0     0     0

In [42]:
print(df)
ndf6 = df.sort_index()
print(ndf6)

      수학  영어  음악  체육
옥호    90    98   130   120
민자    85    88    79    79
영숙    70    95    78    75
      수학  영어  음악  체육
민자    85    88    79    79
영숙    70    95    78    75
옥호    90    98   130   120

In [43]:
ndf7 = df.sort_index(ascending=False)
print(ndf7)

      수학  영어  음악  체육
옥호    90    98   130   120
영숙    70    95    78    75
민자    85    88    79    79

In [47]:
ndf8 =df.sort_values(by='수학', ascending=False)
print(ndf8)

      수학  영어  음악  체육
옥호    90    98   130   120
민자    85    88    79    79
영숙    70    95    78    75

###연산

In [48]:
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
print(student1)

국어    100
영어     80
수학     90
dtype: int64

In [51]:
percentage = student1 / 100
print(percentage)
print(type(percentage))

국어    1.0
영어    0.8
수학    0.9
dtype: float64
<class 'pandas.core.series.Series'>

In [57]:
student2 = pd.Series({'영어':80, '국어':100,'수학':90})
print(student2)

영어     80
국어    100
수학     90
dtype: int64

In [60]:
print(student1)
print(student2)
addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2
print(type(addition))
print(addition)
result = pd.DataFrame([addition, subtraction,
            multiplication, division],
            index= ['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result)

국어    100
영어     80
수학     90
dtype: int64
영어     80
국어    100
수학     90
dtype: int64
<class 'pandas.core.series.Series'>
국어    200
수학    180
영어    160
dtype: int64
           국어    수학    영어
덧셈      200.0   180.0   160.0
뺄셈        0.0     0.0     0.0
곱셈    10000.0  8100.0  6400.0
나눗셈      1.0     1.0     1.0

In [61]:
student1['국어'] = np.nan
student2.drop('영어', inplace=True)
print(student1, '\n', student2)

국어     NaN
영어    80.0
수학    90.0
dtype: float64
 국어    100
수학     90
dtype: int64

In [62]:
addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2
print(type(addition))
print(addition)
result = pd.DataFrame([addition, subtraction,
            multiplication, division],
            index= ['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result)

<class 'pandas.core.series.Series'>
국어      NaN
수학    180.0
영어      NaN
dtype: float64
        국어    수학  영어
덧셈     NaN   180.0   NaN
뺄셈     NaN     0.0   NaN
곱셈     NaN  8100.0   NaN
나눗셈   NaN     1.0   NaN

In [28]:
df.mean(axis=1)

이름
경석    88.25
연주    82.75
선희    79.50
dtype: float64

In [29]:
df_math = df['수학']
df_english = df['영어']
df_music = df['음악']
df_pe = df['체육']

df_total_by_student = df.sum(axis=1)
df_mean_by_student = df.mean(axis=1)

df_mean_by_student

이름
경석    88.25
연주    82.75
선희    79.50
dtype: float64

In [36]:
import seaborn as sns
titanic_df = sns.load_dataset('titanic')
titanic_df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [37]:
titanic_df_new = titanic_df[['age', 'fare']]
titanic_df_new_add100 = titanic_df_new + 100

titanic_df_new_add100

       age      fare
0    122.0  107.2500
1    138.0  171.2833
2    126.0  107.9250
3    135.0  153.1000
4    135.0  108.0500
..     ...       ...
886  127.0  113.0000
887  119.0  130.0000
888    NaN  123.4500
889  126.0  130.0000
890  132.0  107.7500

[891 rows x 2 columns]